Revit 2024 API
PolymeshTopology.DistributionOfNormals Property
 Indicates the distribution of normal vectors along the tessellated polymesh surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public DistributionOfNormals DistributionOfNormals { get; }
Visual Basic
Public ReadOnly Property DistributionOfNormals As DistributionOfNormals
	Get
Visual C++
public:
property DistributionOfNormals DistributionOfNormals {
	DistributionOfNormals get ();
}
See Also
PolymeshTopology Class
Autodesk.Revit.DB Namespace